//演習1-4 右に示すように、１行に１文字ずつ名前を表示するプログラムを作成せよ。
//        表示するのは、著者の名前ではなく、自分の名前とすること。

//画面の入出力を行うためのライブラリを取り込む
#include <iostream>

//stdという名前空間を利用する(現時点では用途不明)
using namespace std;

//============================================================================
//関数名　　　　　：main
//メソッドの説明　：画面への出力を行う
//パラメータの説明：
//返り値　　　　　：
//作成者　　　　　：佐藤 洸
//日付　　　　　　：2019/05/09
//============================================================================
int main()
{
	//名前を１行に１文字ずつ表示させる為、改行を表す\nを一文字毎に記載。
	cout << "佐\n藤\n洸\n";
}
