//演習5-2	要素型がdouble型で要素数が5の配列の全要素に0.0を代入して表示する
//			プログラムを作成せよ。

//画面の入出力を行うためのライブラリを取り込む
#include <iostream>

//浮動小数点表示させるためのライブラリを取り込む
#include <iomanip>

//stdという名前空間を利用する
using namespace std;

//============================================================================
//関数名　　　　　：main
//メソッドの説明　：配列
//パラメータの説明：
//返り値　　　　　：
//作成者　　　　　：佐藤 洸
//日付　　　　　　：2021/06/02
//備考　　　　　　：
//============================================================================
int main()
{
	//要素数を定義する為。
	const int ELEMENT = 5;

	//double型かつ要素数が5つの配列を用意する為。
	double arrayValue[ELEMENT];

	//5回繰り返す為。
	for (int i = 0; i < 5; i++){

		//各要素に値を設定する為。
		arrayValue[i] = 0.0;

		//小数点以下も含め値を出力する為。
		std::cout << std::fixed;
		std::cout << std::setprecision(1) << arrayValue[i] << "\n";
	}
}
